GopalSaraf/Practicals/PSDL/include/proc/pic18f87j60.inc
// Register: ETXNDH
#define ETXNDH ETXNDH
ETXNDH                                   equ 0EE7h

// Register: ERXST
#define ERXST ERXST
ERXST                                    equ 0EE8h

// Register: ERXSTL
#define ERXSTL ERXSTL
ERXSTL                                   equ 0EE8h

// Register: ERXSTH
#define ERXSTH ERXSTH
ERXSTH                                   equ 0EE9h

// Register: ERXND
#define ERXND ERXND
ERXND                                    equ 0EEAh

// Register: ERXNDL
#define ERXNDL ERXNDL
ERXNDL                                   equ 0EEAh

// Register: ERXNDH
#define ERXNDH ERXNDH
ERXNDH                                   equ 0EEBh

// Register: ERXRDPT
#define ERXRDPT ERXRDPT
ERXRDPT                                  equ 0EECh

// Register: ERXRDPTL
#define ERXRDPTL ERXRDPTL
ERXRDPTL                                 equ 0EECh

// Register: ERXRDPTH
#define ERXRDPTH ERXRDPTH
ERXRDPTH                                 equ 0EEDh

// Register: ERXWRPT
#define ERXWRPT ERXWRPT
ERXWRPT                                  equ 0EEEh

// Register: ERXWRPTL
#define ERXWRPTL ERXWRPTL
ERXWRPTL                                 equ 0EEEh

// Register: ERXWRPTH
#define ERXWRPTH ERXWRPTH
ERXWRPTH                                 equ 0EEFh

// Register: EDMAST
#define EDMAST EDMAST
EDMAST                                   equ 0EF0h

// Register: EDMASTL
#define EDMASTL EDMASTL
EDMASTL                                  equ 0EF0h

// Register: EDMASTH
#define EDMASTH EDMASTH
EDMASTH                                  equ 0EF1h

// Register: EDMAND
#define EDMAND EDMAND
EDMAND                                   equ 0EF2h

// Register: EDMANDL
#define EDMANDL EDMANDL
EDMANDL                                  equ 0EF2h

// Register: EDMANDH
#define EDMANDH EDMANDH
EDMANDH                                  equ 0EF3h

// Register: EDMADST
#define EDMADST EDMADST
EDMADST                                  equ 0EF4h

// Register: EDMADSTL
#define EDMADSTL EDMADSTL
EDMADSTL                                 equ 0EF4h

// Register: EDMADSTH
#define EDMADSTH EDMADSTH
EDMADSTH                                 equ 0EF5h

// Register: EDMACS
#define EDMACS EDMACS
EDMACS                                   equ 0EF6h

// Register: EDMACSL
#define EDMACSL EDMACSL
EDMACSL                                  equ 0EF6h

// Register: EDMACSH
#define EDMACSH EDMACSH
EDMACSH                                  equ 0EF7h

// Register: EIE
#define EIE EIE
EIE                                      equ 0EFBh
// bitfield definitions
EIE_RXERIE_POSN                          equ 0000h
EIE_RXERIE_POSITION                      equ 0000h
EIE_RXERIE_SIZE                          equ 0001h
EIE_RXERIE_LENGTH                        equ 0001h
EIE_RXERIE_MASK                          equ 0001h
EIE_TXERIE_POSN                          equ 0001h
EIE_TXERIE_POSITION                      equ 0001h
EIE_TXERIE_SIZE                          equ 0001h
EIE_TXERIE_LENGTH                        equ 0001h
EIE_TXERIE_MASK                          equ 0002h
EIE_TXIE_POSN                            equ 0003h
EIE_TXIE_POSITION                        equ 0003h
EIE_TXIE_SIZE                            equ 0001h
EIE_TXIE_LENGTH                          equ 0001h
EIE_TXIE_MASK                            equ 0008h
EIE_LINKIE_POSN                          equ 0004h
EIE_LINKIE_POSITION                      equ 0004h
EIE_LINKIE_SIZE                          equ 0001h
EIE_LINKIE_LENGTH                        equ 0001h
EIE_LINKIE_MASK                          equ 0010h
EIE_DMAIE_POSN                           equ 0005h
EIE_DMAIE_POSITION                       equ 0005h
EIE_DMAIE_SIZE                           equ 0001h
EIE_DMAIE_LENGTH                         equ 0001h
EIE_DMAIE_MASK                           equ 0020h
EIE_PKTIE_POSN                           equ 0006h
EIE_PKTIE_POSITION                       equ 0006h
EIE_PKTIE_SIZE                           equ 0001h
EIE_PKTIE_LENGTH                         equ 0001h
EIE_PKTIE_MASK                           equ 0040h
EIE_ETXIE_POSN                           equ 0003h
EIE_ETXIE_POSITION                       equ 0003h
EIE_ETXIE_SIZE                           equ 0001h
EIE_ETXIE_LENGTH                         equ 0001h
EIE_ETXIE_MASK                           equ 0008h

// Register: ESTAT
#define ESTAT ESTAT
ESTAT                                    equ 0EFDh
// bitfield definitions
ESTAT_PHYRDY_POSN                        equ 0000h
ESTAT_PHYRDY_POSITION                    equ 0000h
ESTAT_PHYRDY_SIZE                        equ 0001h
ESTAT_PHYRDY_LENGTH                      equ 0001h
ESTAT_PHYRDY_MASK                        equ 0001h
ESTAT_TXABRT_POSN                        equ 0001h
ESTAT_TXABRT_POSITION                    equ 0001h
ESTAT_TXABRT_SIZE                        equ 0001h
ESTAT_TXABRT_LENGTH                      equ 0001h
ESTAT_TXABRT_MASK                        equ 0002h
ESTAT_RXBUSY_POSN                        equ 0002h
ESTAT_RXBUSY_POSITION                    equ 0002h
ESTAT_RXBUSY_SIZE                        equ 0001h
ESTAT_RXBUSY_LENGTH                      equ 0001h
ESTAT_RXBUSY_MASK                        equ 0004h
ESTAT_BUFER_POSN                         equ 0006h
ESTAT_BUFER_POSITION                     equ 0006h
ESTAT_BUFER_SIZE                         equ 0001h
ESTAT_BUFER_LENGTH                       equ 0001h
ESTAT_BUFER_MASK                         equ 0040h

// Register: ECON2
#define ECON2 ECON2
ECON2                                    equ 0EFEh
// bitfield definitions
ECON2_ETHEN_POSN                         equ 0005h
ECON2_ETHEN_POSITION                     equ 0005h
ECON2_ETHEN_SIZE                         equ 0001h
ECON2_ETHEN_LENGTH                       equ 0001h
ECON2_ETHEN_MASK                         equ 0020h
ECON2_PKTDEC_POSN                        equ 0006h
ECON2_PKTDEC_POSITION                    equ 0006h
ECON2_PKTDEC_SIZE                        equ 0001h
ECON2_PKTDEC_LENGTH                      equ 0001h
ECON2_PKTDEC_MASK                        equ 0040h
ECON2_AUTOINC_POSN                       equ 0007h
ECON2_AUTOINC_POSITION                   equ 0007h
ECON2_AUTOINC_SIZE                       equ 0001h
ECON2_AUTOINC_LENGTH                     equ 0001h
ECON2_AUTOINC_MASK                       equ 0080h

// Register: EIR
#define EIR EIR
EIR                                      equ 0F60h
// bitfield definitions
EIR_RXERIF_POSN                          equ 0000h
EIR_RXERIF_POSITION                      equ 0000h
EIR_RXERIF_SIZE                          equ 0001h
EIR_RXERIF_LENGTH                        equ 0001h
EIR_RXERIF_MASK                          equ 0001h
EIR_TXERIF_POSN                          equ 0001h
EIR_TXERIF_POSITION                      equ 0001h
EIR_TXERIF_SIZE                          equ 0001h
EIR_TXERIF_LENGTH                        equ 0001h
EIR_TXERIF_MASK                          equ 0002h
EIR_TXIF_POSN                            equ 0003h
EIR_TXIF_POSITION                        equ 0003h
EIR_TXIF_SIZE                            equ 0001h
EIR_TXIF_LENGTH                          equ 0001h
EIR_TXIF_MASK                            equ 0008h
EIR_LINKIF_POSN                          equ 0004h
EIR_LINKIF_POSITION                      equ 0004h
EIR_LINKIF_SIZE                          equ 0001h
EIR_LINKIF_LENGTH                        equ 0001h
EIR_LINKIF_MASK                          equ 0010h
EIR_DMAIF_POSN                           equ 0005h
EIR_DMAIF_POSITION                       equ 0005h
EIR_DMAIF_SIZE                           equ 0001h
EIR_DMAIF_LENGTH                         equ 0001h
EIR_DMAIF_MASK                           equ 0020h
EIR_PKTIF_POSN                           equ 0006h
EIR_PKTIF_POSITION                       equ 0006h
EIR_PKTIF_SIZE                           equ 0001h
EIR_PKTIF_LENGTH                         equ 0001h
EIR_PKTIF_MASK                           equ 0040h
EIR_ETXIF_POSN                           equ 0003h
EIR_ETXIF_POSITION                       equ 0003h
EIR_ETXIF_SIZE                           equ 0001h
EIR_ETXIF_LENGTH                         equ 0001h
EIR_ETXIF_MASK                           equ 0008h

// Register: EDATA
#define EDATA EDATA
EDATA                                    equ 0F61h
// bitfield definitions
EDATA_EDATA0_POSN                        equ 0000h
EDATA_EDATA0_POSITION                    equ 0000h
EDATA_EDATA0_SIZE                        equ 0001h
EDATA_EDATA0_LENGTH                      equ 0001h
EDATA_EDATA0_MASK                        equ 0001h
EDATA_EDATA1_POSN                        equ 0001h
EDATA_EDATA1_POSITION                    equ 0001h
EDATA_EDATA1_SIZE                        equ 0001h
EDATA_EDATA1_LENGTH                      equ 0001h
EDATA_EDATA1_MASK                        equ 0002h
EDATA_EDATA2_POSN                        equ 0002h
EDATA_EDATA2_POSITION                    equ 0002h
EDATA_EDATA2_SIZE                        equ 0001h
EDATA_EDATA2_LENGTH                      equ 0001h
EDATA_EDATA2_MASK                        equ 0004h
EDATA_EDATA3_POSN                        equ 0003h
EDATA_EDATA3_POSITION                    equ 0003h
EDATA_EDATA3_SIZE                        equ 0001h
EDATA_EDATA3_LENGTH                      equ 0001h
EDATA_EDATA3_MASK                        equ 0008h
EDATA_EDATA4_POSN                        equ 0004h
EDATA_EDATA4_POSITION                    equ 0004h
EDATA_EDATA4_SIZE                        equ 0001h
EDATA_EDATA4_LENGTH                      equ 0001h
EDATA_EDATA4_MASK                        equ 0010h
EDATA_EDATA5_POSN                        equ 0005h
EDATA_EDATA5_POSITION                    equ 0005h
EDATA_EDATA5_SIZE                        equ 0001h
EDATA_EDATA5_LENGTH                      equ 0001h
EDATA_EDATA5_MASK                        equ 0020h
EDATA_EDATA6_POSN                        equ 0006h
EDATA_EDATA6_POSITION                    equ 0006h
EDATA_EDATA6_SIZE                        equ 0001h
EDATA_EDATA6_LENGTH                      equ 0001h
EDATA_EDATA6_MASK                        equ 0040h
EDATA_EDATA7_POSN                        equ 0007h
EDATA_EDATA7_POSITION                    equ 0007h
EDATA_EDATA7_SIZE                        equ 0001h
EDATA_EDATA7_LENGTH                      equ 0001h
EDATA_EDATA7_MASK                        equ 0080h

// Register: ECCP2DEL
#define ECCP2DEL ECCP2DEL
ECCP2DEL                                 equ 0F67h
// bitfield definitions
ECCP2DEL_PDC_POSN                        equ 0000h
ECCP2DEL_PDC_POSITION                    equ 0000h
ECCP2DEL_PDC_SIZE                        equ 0007h
ECCP2DEL_PDC_LENGTH                      equ 0007h
ECCP2DEL_PDC_MASK                        equ 007Fh
ECCP2DEL_PRSEN_POSN                      equ 0007h
ECCP2DEL_PRSEN_POSITION                  equ 0007h
ECCP2DEL_PRSEN_SIZE                      equ 0001h
ECCP2DEL_PRSEN_LENGTH                    equ 0001h
ECCP2DEL_PRSEN_MASK                      equ 0080h
ECCP2DEL_PDC0_POSN                       equ 0000h
ECCP2DEL_PDC0_POSITION                   equ 0000h
ECCP2DEL_PDC0_SIZE                       equ 0001h
ECCP2DEL_PDC0_LENGTH                     equ 0001h
ECCP2DEL_PDC0_MASK                       equ 0001h
ECCP2DEL_PDC1_POSN                       equ 0001h
ECCP2DEL_PDC1_POSITION                   equ 0001h
ECCP2DEL_PDC1_SIZE                       equ 0001h
ECCP2DEL_PDC1_LENGTH                     equ 0001h
ECCP2DEL_PDC1_MASK                       equ 0002h
ECCP2DEL_PDC2_POSN                       equ 0002h
ECCP2DEL_PDC2_POSITION                   equ 0002h
ECCP2DEL_PDC2_SIZE                       equ 0001h
ECCP2DEL_PDC2_LENGTH                     equ 0001h
ECCP2DEL_PDC2_MASK                       equ 0004h
ECCP2DEL_PDC3_POSN                       equ 0003h
ECCP2DEL_PDC3_POSITION                   equ 0003h
ECCP2DEL_PDC3_SIZE                       equ 0001h
ECCP2DEL_PDC3_LENGTH                     equ 0001h
ECCP2DEL_PDC3_MASK                       equ 0008h
ECCP2DEL_PDC4_POSN                       equ 0004h
ECCP2DEL_PDC4_POSITION                   equ 0004h
ECCP2DEL_PDC4_SIZE                       equ 0001h
ECCP2DEL_PDC4_LENGTH                     equ 0001h
ECCP2DEL_PDC4_MASK                       equ 0010h
ECCP2DEL_PDC5_POSN                       equ 0005h
ECCP2DEL_PDC5_POSITION                   equ 0005h
ECCP2DEL_PDC5_SIZE                       equ 0001h
ECCP2DEL_PDC5_LENGTH                     equ 0001h
ECCP2DEL_PDC5_MASK                       equ 0020h
ECCP2DEL_PDC6_POSN                       equ 0006h
ECCP2DEL_PDC6_POSITION                   equ 0006h
ECCP2DEL_PDC6_SIZE                       equ 0001h
ECCP2DEL_PDC6_LENGTH                     equ 0001h
ECCP2DEL_PDC6_MASK                       equ 0040h
ECCP2DEL_P2DC0_POSN                      equ 0000h
ECCP2DEL_P2DC0_POSITION                  equ 0000h
ECCP2DEL_P2DC0_SIZE                      equ 0001h
ECCP2DEL_P2DC0_LENGTH                    equ 0001h
ECCP2DEL_P2DC0_MASK                      equ 0001h
ECCP2DEL_P2DC1_POSN                      equ 0001h
ECCP2DEL_P2DC1_POSITION                  equ 0001h
ECCP2DEL_P2DC1_SIZE                      equ 0001h
ECCP2DEL_P2DC1_LENGTH                    equ 0001h
ECCP2DEL_P2DC1_MASK                      equ 0002h
ECCP2DEL_P2DC2_POSN                      equ 0002h
ECCP2DEL_P2DC2_POSITION                  equ 0002h
ECCP2DEL_P2DC2_SIZE                      equ 0001h
ECCP2DEL_P2DC2_LENGTH                    equ 0001h
ECCP2DEL_P2DC2_MASK                      equ 0004h
ECCP2DEL_P2DC3_POSN                      equ 0003h
ECCP2DEL_P2DC3_POSITION                  equ 0003h
ECCP2DEL_P2DC3_SIZE                      equ 0001h
ECCP2DEL_P2DC3_LENGTH                    equ 0001h
ECCP2DEL_P2DC3_MASK                      equ 0008h
ECCP2DEL_P2DC4_POSN                      equ 0004h
ECCP2DEL_P2DC4_POSITION                  equ 0004h
ECCP2DEL_P2DC4_SIZE                      equ 0001h
ECCP2DEL_P2DC4_LENGTH                    equ 0001h
ECCP2DEL_P2DC4_MASK                      equ 0010h
ECCP2DEL_P2DC5_POSN                      equ 0005h
ECCP2DEL_P2DC5_POSITION                  equ 0005h
ECCP2DEL_P2DC5_SIZE                      equ 0001h
ECCP2DEL_P2DC5_LENGTH                    equ 0001h
ECCP2DEL_P2DC5_MASK                      equ 0020h
ECCP2DEL_P2DC6_POSN                      equ 0006h
ECCP2DEL_P2DC6_POSITION                  equ 0006h
ECCP2DEL_P2DC6_SIZE                      equ 0001h
ECCP2DEL_P2DC6_LENGTH                    equ 0001h
ECCP2DEL_P2DC6_MASK                      equ 0040h
ECCP2DEL_P2RSEN_POSN                     equ 0007h
ECCP2DEL_P2RSEN_POSITION                 equ 0007h
ECCP2DEL_P2RSEN_SIZE                     equ 0001h
ECCP2DEL_P2RSEN_LENGTH                   equ 0001h
ECCP2DEL_P2RSEN_MASK                     equ 0080h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0F68h
// bitfield definitions
ECCP2AS_PSSBD_POSN                       equ 0000h
ECCP2AS_PSSBD_POSITION                   equ 0000h
ECCP2AS_PSSBD_SIZE                       equ 0002h
ECCP2AS_PSSBD_LENGTH                     equ 0002h
ECCP2AS_PSSBD_MASK                       equ 0003h
ECCP2AS_PSSAC_POSN                       equ 0002h
ECCP2AS_PSSAC_POSITION                   equ 0002h
ECCP2AS_PSSAC_SIZE                       equ 0002h
ECCP2AS_PSSAC_LENGTH                     equ 0002h
ECCP2AS_PSSAC_MASK                       equ 000Ch
ECCP2AS_ECCPAS_POSN                      equ 0004h
ECCP2AS_ECCPAS_POSITION                  equ 0004h
ECCP2AS_ECCPAS_SIZE                      equ 0003h
ECCP2AS_ECCPAS_LENGTH                    equ 0003h
ECCP2AS_ECCPAS_MASK                      equ 0070h
ECCP2AS_ECCPASE_POSN                     equ 0007h
ECCP2AS_ECCPASE_POSITION                 equ 0007h
ECCP2AS_ECCPASE_SIZE                     equ 0001h
ECCP2AS_ECCPASE_LENGTH                   equ 0001h
ECCP2AS_ECCPASE_MASK                     equ 0080h
ECCP2AS_PSSBD0_POSN                      equ 0000h
ECCP2AS_PSSBD0_POSITION                  equ 0000h
ECCP2AS_PSSBD0_SIZE                      equ 0001h
ECCP2AS_PSSBD0_LENGTH                    equ 0001h
ECCP2AS_PSSBD0_MASK                      equ 0001h
ECCP2AS_PSSBD1_POSN                      equ 0001h
ECCP2AS_PSSBD1_POSITION                  equ 0001h
ECCP2AS_PSSBD1_SIZE                      equ 0001h
ECCP2AS_PSSBD1_LENGTH                    equ 0001h
ECCP2AS_PSSBD1_MASK                      equ 0002h
ECCP2AS_PSSAC0_POSN                      equ 0002h
ECCP2AS_PSSAC0_POSITION                  equ 0002h
ECCP2AS_PSSAC0_SIZE                      equ 0001h
ECCP2AS_PSSAC0_LENGTH                    equ 0001h
ECCP2AS_PSSAC0_MASK                      equ 0004h
ECCP2AS_PSSAC1_POSN                      equ 0003h
ECCP2AS_PSSAC1_POSITION                  equ 0003h
ECCP2AS_PSSAC1_SIZE                      equ 0001h
ECCP2AS_PSSAC1_LENGTH                    equ 0001h
ECCP2AS_PSSAC1_MASK                      equ 0008h
ECCP2AS_ECCPAS0_POSN                     equ 0004h
ECCP2AS_ECCPAS0_POSITION                 equ 0004h
ECCP2AS_ECCPAS0_SIZE                     equ 0001h
ECCP2AS_ECCPAS0_LENGTH                   equ 0001h
ECCP2AS_ECCPAS0_MASK                     equ 0010h
ECCP2AS_ECCPAS1_POSN                     equ 0005h
ECCP2AS_ECCPAS1_POSITION                 equ 0005h
ECCP2AS_ECCPAS1_SIZE                     equ 0001h
ECCP2AS_ECCPAS1_LENGTH                   equ 0001h
ECCP2AS_ECCPAS1_MASK                     equ 0020h
ECCP2AS_ECCPAS2_POSN                     equ 0006h
ECCP2AS_ECCPAS2_POSITION                 equ 0006h
ECCP2AS_ECCPAS2_SIZE                     equ 0001h
ECCP2AS_ECCPAS2_LENGTH                   equ 0001h
ECCP2AS_ECCPAS2_MASK                     equ 0040h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h

